       *************************
       ** COMMENT
        01 VARIABLE-01 PIC X(10).
        	10 SUB-VAR PIC X(5).
        	10 SUB-VAR2 PIC XXXX.
       * 